---
type: IDuctFittingAndAccessoryPressureDropServer
namespace: Autodesk.Revit.DB.Mechanical
version: 2024
members: 3
tags: [revit-api, class]
---

# IDuctFittingAndAccessoryPressureDropServer

`Autodesk.Revit.DB.Mechanical.IDuctFittingAndAccessoryPressureDropServer` · Revit 2024 · 3 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | Calculate | 2014 | `bool Calculate ( DuctFittingAndAccessoryPressureDropData data )` |
| Method | GetDataSchema | 2014 | `Schema GetDataSchema ()` |
| Method | IsApplicable | 2014 | `bool IsApplicable ( DuctFittingAndAccessoryPressureDropData data )` |